{
  "en": {
    "about": {
      "title": "About",
      "description": "As a full-stack developer, my experience and knowledge span a wide range of technologies and tools, allowing me to tackle projects from start to finish. On the frontend side, React is my preferred choice for developing modern and highly interactive user interfaces. Regarding architecture, I lean towards the microservices approach.",
      "summary": "In summary, as a full-stack developer with experience in MongoDB, Node.js, Express, React, JWT, microservices, and Docker..."
    },
    "skills": {
      "title": "Skills"
    }, 
    "technologies": {
      "title": "Technologies"
    },
    "projects": {
      "title": "Projects"
    },
    "project": {
      "1": {
        "name": "Wordpress",
        "description_cut": "Content Management System (CMS)",
        "description": "Wordpress is a content management system (CMS) that allows you to create and manage websites easily and flexibly. It is widely used for blogs, corporate websites, online stores, and more. It offers a wide range of plugins and themes to customize and extend the site\"s functionality."
        },
    "2":{
      "name": "ReactJS",
      "description_cut": "JavaScript library for building user interfaces",
      "description": "ReactJS is a JavaScript library developed by Facebook for building interactive and responsive user interfaces. It is based on reusable components that make it easy to create modern and efficient web applications. React is commonly used in the development of single-page applications (SPAs) and integrates well with other technologies and libraries."
       },
    "3":{  
      "name": "MongoDB",
      "description_cut": "Document-oriented NoSQL database",
      "description": "MongoDB is a NoSQL database that stores data in a document-oriented format, such as JSON. It is scalable and flexible, making it suitable for applications that require fast and schema-free data storage. MongoDB is commonly used in web applications, mobile apps, and big data projects."
      },
     "4": {
      "name": "Nodejs",
      "description_cut": "JavaScript runtime environment on the server side",
      "description": "Node.js is a JavaScript runtime environment that allows you to run JavaScript code on the server side. It is known for its ability to handle multiple connections efficiently, making it suitable for real-time applications, web servers, and APIs. Node.js is built on the Google Chrome V8 engine and is highly popular in modern web application development."
    },
    "5": {
      "name": "Express",
      "description_cut": "Node.js framework for building web applications",
      "description": "Express is a Node.js framework that simplifies the creation of web applications and APIs. It provides a set of functions and tools for handling routes, requests, and responses efficiently. Express"
    },
    "6":{
      "name": "Wordpress",
      "description_cut": "WordPress allows you to manage your website or blog autonomously.",
      "description": "It is a database system that allows users to add, modify and organize themes, plugins and other types of content. Every WordPress website owner can access the dashboard to manage their site from a single place."
     },
     "7":{
      "name": "Docker",
      "description_cut": "IT software called Docker is the containerization technology of Linux®.",
      "description": "With Docker, you can use containers as very lightweight, modular virtual machines, giving you the flexibility to create, deploy, copy, and move them from one environment to another, allowing you to optimize applications for the cloud."
     },
     "8":{
      "name": "Amazon Web Service",
      "description_cut": "AWS Services: Infrastructure software, DevOps, Machine Learning.",
      "description": "They provide storage, networking, databases, web and mobile application services, security, computing power, messaging, artificial intelligence, identity and compliance."
     }
    },
    "developers": {
      "title": "Full Stack Developers"
    },
    "cards": {
      "1": {
        "nombre": "Wordpress",
        "descripcion": "No-code page design, with Elementor Pro, contact form registration email configuration"
      },
      "2": {
        "nombre": "Pi Food",
        "descripcion": "apply the technologies learned in the bootcamps with nodejs, express, react, redux, sequelize, css."
      },
      "3": {
        "nombre": "Cyberzon3",
        "descripcion": "travel e-commerce integration project."
      },
      "4": {
        "nombre": "MicroService",
        "descripcion": "implementing a docker microservice with google cloud API - CRUD"
      },
      "5": {
        "nombre": "Wordpress CGSEVENTS",
        "descripcion": "event development company in Cacino and Metaverses, with the standards of the regulatory federation"
      },
      "6": {
        "nombre": "Wordpress H2-LATAMSUMMIT",
        "descripcion": "event development company in Cacino and Metaverses, with the standards of the regulatory federation"
      },
      "7": {
        "nombre": "Wordpress PERGLODI",
        "descripcion": "We give a personality to your business and entrepreneurship through a concept or idea that you have dreamed of or thought about at some point."
      },
      "8": {
        "nombre": "Wordpress CGS Brasil",
        "descripcion": "Participe de eventos exclusivos para executivos no Brasil. Conferências, treinamento e networking no CGS 2024. Reserve seu lugar hoje e conecte-se com profissionais líderes em todo o mundo."
      },
      "9": {
        "nombre": "MERN Qauntum",
        "descripcion": "Optimization, Digitization and Automation of Investment Portfolios with Artificial Intelligence."
      }
    },
    "Contact": {
      "title":"About Me",
      "descripcion": "I am a developer who likes to face new challenges to learn based on the implementation to be carried out."
    },
    "Form": {
      "name":"Name",
      "email": "Email",
      "description": "How Can We Help You?"
    },
    "navbar": {
      "home": "Home",
      "about": "About",
      "skill": "Skill",
      "projects": "Project",
      "contact": "Contact"
    },
    "button": {
      "title":"Let's go to the Web"
    }
  },
  "es": {
    "about": {
      "title": "Acerca",
      "description": "Como desarrollador full stack, mi experiencia y conocimiento se extienden por una amplia gama de tecnologías y herramientas. En el lado del frontend, React es mi elección preferida para desarrollar interfaces de usuario modernas y altamente interactivas. En cuanto a la arquitectura, me inclino hacia el enfoque de microservicios.",
      "summary": "En resumen, como desarrollador full stack con experiencia en MongoDB, Node.js, Express, React, JWT, microservicios y Docker..."
    },
    "skills": {
      "title": "Habilidades"
    }, 
    "technologies": {
      "title": "Tecnologias"
    },
    "projects": {
      "title": "Proyectos"
    },
    "project":{
      "1": {
        "name": "Wordpress",
        "description_cut": "Plataforma de gestión de contenido (CMS)",
        "description": "Wordpress es una plataforma de gestión de contenido (CMS) que permite crear y administrar sitios web de manera sencilla y versátil. Es ampliamente utilizado para blogs, sitios web corporativos, tiendas en línea y más. Ofrece una gran cantidad de complementos y temas para personalizar y extender las funcionalidades del sitio."
         },
    "2":{
      "name": "ReactJS",
      "description_cut": "Biblioteca de JavaScript para construir interfaces de usuario",
      "description": "ReactJS es una biblioteca de JavaScript desarrollada por Facebook que se utiliza para construir interfaces de usuario interactivas y reactivas. Se basa en componentes reutilizables que facilitan la creación de aplicaciones web modernas y eficientes. React se utiliza comúnmente en el desarrollo de aplicaciones de una sola página (SPA) y se integra bien con otras tecnologías y bibliotecas."
    },
    "3":{  
      "name": "MongoDB",
      "description_cut": "Base de datos NoSQL orientada a documentos",
      "description": "MongoDB es una base de datos NoSQL que almacena datos en un formato orientado a documentos, como JSON. Es escalable y flexible, lo que lo hace adecuado para aplicaciones que requieren un almacenamiento de datos rápido y sin esquemas rígidos. MongoDB se utiliza comúnmente en aplicaciones web, aplicaciones móviles y proyectos de big data."
    },
     "4": {
      "name": "Nodejs",
      "description_cut": "Entorno de tiempo de ejecución de JavaScript en el lado del servidor",
      "description": "Node.js es un entorno de tiempo de ejecución de JavaScript que permite ejecutar código JavaScript en el lado del servidor. Es conocido por su capacidad para manejar múltiples conexiones de manera eficiente, lo que lo hace adecuado para aplicaciones en tiempo real, servidores web y API. Node.js se basa en el motor V8 de Google Chrome y es muy popular en el desarrollo de aplicaciones web modernas."
      },
    "5": {
      "name": "Express",
      "description_cut": "Framework de Node.js para construir aplicaciones web",
      "description": "Express es un framework de Node.js que simplifica la creación de aplicaciones web y API. Proporciona una serie de funciones y herramientas para manejar rutas, peticiones y respuestas de manera eficiente. Express es ampliamente utilizado en el desarrollo de aplicaciones web y API con Node.js debido a su simplicidad y flexibilidad."
    },
    "6":{
      "name": "JavaScript",
      "description_cut": "WordPress te permite gestionar tu sitio web o blog de forma autónoma.",
      "description": "Es sistema de base de datos que permite a los usuarios añadir, modificar y organizar, temas, plugins y otros tipos de contenido. Cada propietario de un sitio web de WordPress puede acceder al panel de control para gestionar su sitio desde un único lugar."
     },
     "7":{
      "name": "Docker",
      "description_cut": "Sofware TI llamado Docker es la tecnología de organización en contenedores de Linux®.",
      "description": "Con Docker, puede utilizar los contenedores como máquinas virtuales muy livianas y modulares, y obtiene la flexibilidad necesaria para crearlos, implementarlos, copiarlos y trasladarlos de un entorno a otro, lo cual le permite optimizar las aplicaciones para la nube."
     },
     "8":{
      "name": "Amazon Web Service",
      "description_cut": "AWS Servicios: Software de infraestructura, DevOps, Machine Learning.",
      "description": "Brindan almacenamiento, redes, bases de datos, servicios de aplicaciones web y móviles, seguridad, potencia de cómputo, mensajería, inteligencia artificial, identidad y conformidad."
     } 
    },
    "developers": {
      "title": "Desarrolladores Full Stack"
    },
    "cards": {
      "1": {
        "nombre": "Wordpress",
        "descripcion": "Diseño de páginas sin código, con Elementor Pro, configuración de registro de formulario de contacto por correo electrónico"
      },
      "2": {
        "nombre": "Pi Food",
        "descripcion": "aplicar las tecnologías aprendidas en los bootcamps con nodejs, express, react, redux, sequelize, css."
      },
      "3": {
        "nombre": "Cyberzon3",
        "descripcion": "proyecto de integración de comercio electrónico de viajes."
      },
      "4": {
        "nombre": "MicroService",
        "descripcion": "implementación de un microservicio de Docker con la API de Google Cloud - CRUD"
      },
      "5": {
        "nombre": "Wordpress CGSEVENTS",
        "descripcion": "empresa de desarrollo de eventos en Cacino y Metaversos, con los estándares de la federación regulatoria"
      },
      "6": {
        "nombre": "Wordpress H2-LATAMSUMMIT",
        "descripcion": "empresa de desarrollo de eventos en Cacino y Metaversos, con los estándares de la federación regulatoria"
      },
      "7": {
        "nombre": "Wordpress PERGLODI",
        "descripcion": "Le damos personalidad a tu negocio y emprendimiento a través de un concepto o idea que hayas soñado o pensado en algún momento."
      },
      "8": {
        "nombre": "Wordpress CGS Brasil",
        "descripcion": "Únete a eventos exclusivos para ejecutivos en Brasil. Conferencias, capacitación y networking en CGS 2024. Reserva tu lugar hoy y conecta con profesionales destacados a nivel global."
      },
      "9": {
        "nombre": "MERN Qauntum",
        "descripcion": "Optimización, Digitalización y Automatizaciones de Portafolios de Inversión con Inteligencia Artificial."
      }

    },
    "navbar": {
      "home": "Inicio",
      "about": "Quien Soy",
      "skill": "Habilidades",
      "projects": "Proyectos",
      "contact": "Contacto"
    },
    "Form": {
      "name":"Nombre",
      "email": "Correo",
      "description": "¿Como podemos ayudarte?"
    },
    "Contact": {
      "title":"Sobre Mi",
      "descripcion": "Soy un desarrollador al que le gusta afrontar nuevos retos para aprender en base a la implementación a realizar."
    },
    "button": {
      "title":"Vamos a la Web"
    }
  }
}
